notifi-it/WFH/firmware/sdkconfig.defaults
# Waveshare ESP32-S3-Touch-AMOLED-1.8 — ESP32-S3R8, 16MB flash, 8MB octal PSRAM
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# QEMU has no PSRAM model — boot anyway instead of aborting (real board unaffected).
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
